## Dataframes são compostos de Series e boa parte de suas manipulações não alteram o df original

In [4]:
import pandas as pd
from numpy.random import randn

In [6]:
df = pd.DataFrame(randn(5,4), index=['A','B','C','D','E'], columns='W X Y Z'.split())

In [8]:
df

          W         X         Y         Z
A  0.781779 -0.658065 -0.632014  1.280898
B -0.490781  0.419693  0.354613  1.392157
C  0.553514  0.601062 -0.893760  0.275576
D  0.323342 -0.746102  0.427726  1.141510
E -0.622499 -1.305960  0.416695 -0.465319

In [18]:
df["W"] # Ao acessar uma coluna de um DataFrame dessa forma ele retorna uma Series

A    0.781779
B   -0.490781
C    0.553514
D    0.323342
E   -0.622499
Name: W, dtype: float64

In [30]:
df[['W']] # Mas acessando ele no formato de lista ele retorna a formatação padrão

          W
A  0.781779
B -0.490781
C  0.553514
D  0.323342
E -0.622499

## É possível acrescentar colunas com operações

In [40]:
df['NEW'] = df['Y'] + df['Z']
df

          W         X         Y         Z       NEW
A  0.781779 -0.658065 -0.632014  1.280898  0.648884
B -0.490781  0.419693  0.354613  1.392157  1.746770
C  0.553514  0.601062 -0.893760  0.275576 -0.618184
D  0.323342 -0.746102  0.427726  1.141510  1.569236
E -0.622499 -1.305960  0.416695 -0.465319 -0.048624

## O método drop remove uma coluna do DataFrame e exibe ele como uma cópia do original sem a coluna ou linha especificada

In [58]:
df.drop('NEW', axis=1) 
# Também é possível salvar essa versão em variáveis
# O axis(Eixo) pode ser 0 para linhas ou 1 para colunas

          W         X         Y         Z
A  0.781779 -0.658065 -0.632014  1.280898
B -0.490781  0.419693  0.354613  1.392157
C  0.553514  0.601062 -0.893760  0.275576
D  0.323342 -0.746102  0.427726  1.141510
E -0.622499 -1.305960  0.416695 -0.465319

In [52]:
df # Reexibindo o DataFrame original ele ainda possui a coluna NEW

          W         X         Y         Z       NEW
A  0.781779 -0.658065 -0.632014  1.280898  0.648884
B -0.490781  0.419693  0.354613  1.392157  1.746770
C  0.553514  0.601062 -0.893760  0.275576 -0.618184
D  0.323342 -0.746102  0.427726  1.141510  1.569236
E -0.622499 -1.305960  0.416695 -0.465319 -0.048624

## Para remove-lo definitivamente é necessário acrescentar o inplace ao método drop

In [62]:
df.drop('NEW', axis=1, inplace=True)

In [66]:
df # DataFrame com a coluna NEW removida no modelo original

          W         X         Y         Z
A  0.781779 -0.658065 -0.632014  1.280898
B -0.490781  0.419693  0.354613  1.392157
C  0.553514  0.601062 -0.893760  0.275576
D  0.323342 -0.746102  0.427726  1.141510
E -0.622499 -1.305960  0.416695 -0.465319

## Acessando linhas de um DataFrame com loc e iloc

In [81]:
df.loc['A'] # Ele exibe de forma transposta as colunas como indices dos dados daquela linha

W    0.781779
X   -0.658065
Y   -0.632014
Z    1.280898
Name: A, dtype: float64

In [79]:
df.loc[['A']]

          W         X         Y         Z
A  0.781779 -0.658065 -0.632014  1.280898